---
layout: new
title: {{ site.com }}
---

<div id="header">
	<div id="lang">
		<a href="/index_en.html">English</a>
	</div>

	<div id="logo">
		<a href="/"><img src="images/logo.jpg" alt="" /></a>
	</div>		
	<ul>
		<li><a href="ippbx.html"><span>企业通讯解决方案</span></a></li>
		<li><a href="callcenter.html"><span>呼叫中心解决方案</span></a></li>
		<li><a href="commanding_dispatching.html"><span>指挥调度解决方案</span></a></li>
		<li><a href="sip_video.html"><span>视频解决方案</span></a></li>
		<li><a href="freeswitch_solutions.html"><span>FreeSWITCH</span></a></li>
	</ul>
</div>
<div id="body">
	<div class="about">
		<h1>FreeSWITCH A计划</h1>
		<div>
<p>			FAI - The FreeSWITCH Army Initiative
<p>
声明：这只是一个草稿，我们会不断完善它。
<p>
FreeSWITCH A计划是由Seven Du发起的一项开源团队发展计划。旨在以FreeSWITCH为根本立足点，打造一支富有创新力和战斗力的，为客户提供个性化的通信、IT系统咨询和软硬件开发的富有战斗力和创造力的专业技术团队。
<p>

你是否曾经迷茫？-
<p>

<li>你是否刚刚走出象牙塔对技术和未来充满憧憬却不知从何下手？
<li>你是否在以往的工作中小有所成并想在接下来的一两年内大展身手？
<li>你是否身怀绝技想找两个有缘的小兄弟倾囊相授？
<li>你是否奋斗多年却没有质的突破？
<li>你是否喜欢开源却又不知道如何变现？
<li>你是否厌倦了大城市的雾霾想找一个环境优美的城市轻松地生活？
<li>你是否想过有朝一日可以运筹帷幄（在家里工作）？

<p>
考虑一下你是否愿意加入我们 -

<p>
我们是FreeSWITCH Solutions LLC在中国的唯一合作伙伴。多年来，我们的团队对FreeSWITCH等开源项目有很多贡献。我们也为政府、运营商、金融、保险、石油、煤炭等各行各业提供咨询服务、系统开发与解决方案。我们的客户遍及亚欧美。

<p>
我们需要你 -

<li>有团队精神
<li>有创新精神
<li>喜欢 Linux
<li>喜欢 VoIP
<li>喜欢 Play 各种编程语言
<li>喜欢开源软件
<li>喜欢钻研新技术
<li>喜欢读书
<li>喜欢运动
<li>喜欢思考
<li>态度积极向上

<p>
我们希望你 -
<p>
<li>努力工作
<li>不怕创业路上的荆棘与泥泞，自强不息
<p>
我们也不拒绝 -

<li>工作狂
<li>技术控

<p>
你将有机会 ---
<p>
<li>学习和钻研各种各样的技术，比如 Linux/Windows/MacOSX C/C++/C#(gcc/VisualStudio)  Erlang/Go Ruby/Rails HTTP/HTML5/Javascript/Flex PostgreSQL/MySQL SIP/FreeSWITCH/OpenSIPS/Kamailio Git/SVN
<li>提高英语水平，参与国际化的项目
<li>参与开源项目、融入开源社区，你的工作会让全世界的人受益
<li>建设最先进的语音云计算平台
<li>到全国甚至世界各地出差/旅游
<li>帮助我们建设一个世界一流的技术团队
<li>在世界一流的技术团队里引领一种新文化，从而吸引更多的像你一样的人才加入我们
<li>切实体验敏捷团队的开发和进化过程
<li>领导一个技术小组完成各种各样新奇而又有趣的任务
<li>创建世界领先的将切实改变人们生产和生活的系统
<li>拿到一份对得起自己的薪酬

<p>
我们坚信我们有良好的发展前景，加上我们丰富的行业经验，国际领先的技术，国际化、现代化的管理方式，宽松、舒适、自由、敏捷的的工作和开发环境，我们可以实现每一个人的梦想。
<p>
任何人都可以加入我们，不管背景和资历，但我们有一个共同的目标 — 成长！所以，我们希望最终每个技术人员都能成为全栈工程师，每个设计人员都成为顶尖的设计师。每个人都能成为系统咨询师和培训师，能独挡一面，成为自己的老板，成为老板的老板！
<p>
什么叫成为老板的老板？
<p>
上苍是公平的，你做的越多，得到的就越多。上苍有时候又是不公平的，你的付出可能跟回报不成正比。但是，……，但是，在这里，只要你努力，你将可以以你喜欢的工作方式工作，有机会挣到比老板挣到更多的钱。也就是说，你的成功掌握在自己手上。
<p>
我们有以下几种工作方式
<p>
<li>烟台，办公室，朝九晚五，其它时间自由支配（全职）

<li>任何有互联网的地方，远程工作（全职）

<li>任何有互联网的地方，远程工作（兼职/On Demand）

<li>团队。如果你已经有一个团队，也可以以团队的方式整体加入我们或与我们合作。

<p>
所有全职员工，都可以选择成为公司的股东！
<p>

唯一约束
<p>
你在我们团队可以学到技术，学到国际化的团队协作和管理经验。你在任何时候都可以选择离开，你可以带走技术，但是，你不能（直接或变相地）带走代码（开源的除外），也不能带走客户！团队所有的客户都归团队所有，任何人走之前都需要确保安全交接！
<p>
声明：这只是一个草稿，我们会不断完善它。
		</div>
	</div>
</div>
